const API_CONFIG = {
   serviceKey:"v%2BiTRh4RmyTrvuNjU3fgBKGf%2FetKbSoStNKapuVrLc2R%2BdBXgDDvq22Q0JyRWLBhCuDHLVjosMSoO0eLcdz3Ow%3D%3D"
};

const areas= {
    "서울": "1", "인천": "2", "대전": "3", "대구": "4",
    "광주": "5", "부산": "6", "울산": "7", "세종특별자치시": "8",
    "경기도": "31", "강원도": "32", "충청북도": "33", "충청남도": "34",
    "경상북도": "35", "경상남도": "36", "전라북도": "37", "전라남도": "38",
    "제주도": "39"
};
const  arranges = {
    "제목순": "A", "조회순": "B", "수정일순": "C", "생성일순": "D"
};
const contentTypes= {
    "관광지": "12", "문화시설": "14", "축제/공연/행사": "15",
    "여행코스": "25", "레포츠": "28", "숙박": "32", "쇼핑": "38", "음식점": "39"
};
const sigungus = {
    "강진군": "1", "고흥군": "2", "곡성군": "3", "광양시": "4",
    "구례군": "5", "나주시": "6", "담양군": "7", "목포시": "8",
    "무안군": "9", "보성군": "10", "순천시": "11", "신안군": "12",
    "여수시": "13", "영광군": "14", "영암군": "15", "완도군": "16",
    "장성군": "17", "장흥군": "18", "진도군": "19", "함평군": "20",
    "해남군": "21", "화순군": "22"
}
;

//export { API_CONFIG, areas, arranges, contentTypes, sigungus };
