// API 데이터 저장
const API_CONFIG = {
   serviceKey:"v%2BiTRh4RmyTrvuNjU3fgBKGf%2FetKbSoStNKapuVrLc2R%2BdBXgDDvq22Q0JyRWLBhCuDHLVjosMSoO0eLcdz3Ow%3D%3D"
};

const  culture = {
    "영어": "A", "한국어": "B"
};
const  arranges = {
    "제목순": "A", "조회순": "B", "수정일순": "C", "생성일순": "D"
};

const contentTypes= {
    "관광지": "12", "문화시설": "14", "축제/공연/행사": "15",
    "여행코스": "25", "레포츠": "28", "숙박": "32", "쇼핑": "38", "음식점": "39"
};
const sigungus = {
    "강진군": "1", "고흥군": "2", "곡성군": "3", "광양시": "4",
    "구례군": "5", "나주시": "6", "담양군": "7", "목포시": "8",
    "무안군": "9", "보성군": "10", "순천시": "11", "신안군": "12",
    "여수시": "13", "영광군": "14", "영암군": "15", "완도군": "16",
    "장성군": "17", "장흥군": "18", "진도군": "19", "함평군": "20",
    "해남군": "21", "화순군": "22"
};

const categoryCode1 = {
    "자연": "A01",
    "인문(문화/예술/역사)": "A02",
    "레포츠": "A03",
    "쇼핑": "A04",
    "음식": "A05",
    "숙박": "B02",
    "추천코스": "C01"
};

const categoryCode2 = {
    "자연관광지": "A0101",
    "관광자원": "A0102",
    "역사관광지": "A0201",
    "휴양관광지": "A0202",
    "체험관광지": "A0203",
    "산업관광지": "A0204",
    "건축/조형물": "A0205",
    "문화시설": "A0206",
    "축제": "A0207",
    "공연/행사": "A0208",
    "레포츠소개": "A0301",
    "육상 레포츠": "A0302",
    "수상 레포츠": "A0303",
    "항공 레포츠": "A0304",
    "복합 레포츠": "A0305",
    "쇼핑":"A0401",
    "음식점":"A0501",
    "숙박시설":"B0201",
    "가족코스": "C0112",
    "나홀로코스": "C0113",
    "힐링코스": "C0114",
    "도보코스": "C0115",
    "캠핑코스": "C0116",
    "맛코스": "C0117"
};

const categoryCode3 = {
    "국립공원": "A01010100",
    "도립공원": "A01010200",
    "군립공원": "A01010300",
    "산": "A01010400",
    "자연생태관광지": "A01010500",
    "자연휴양림": "A01010600",
    "수목원": "A01010700",
    "폭포": "A01010800",
    "계곡": "A01010900",
    "약수터": "A01011000",
    "해안절경": "A01011100",
    "해수욕장": "A01011200",
    "섬": "A01011300",
    "항구/포구": "A01011400",
    "등대": "A01011600",
    "호수": "A01011700",
    "강": "A01011800",
    "동굴": "A01011900",

     "희귀동·식물": "A01020100",
    "기암괴석": "A01020200",

    "고궁": "A02010100",
    "성": "A02010200",
    "문": "A02010300",
    "고택": "A02010400",
    "생가": "A02010500",
    "민속마을": "A02010600",
    "유적지/사적지": "A02010700",
    "사찰": "A02010800",
    "종교성지": "A02010900",
    "안보관광": "A02011000",

    "관광단지": "A02020200",
    "온천/욕장/스파": "A02020300",
    "이색찜질방": "A02020400",
    "헬스투어": "A02020500",
    "테마공원": "A02020600",
    "공원": "A02020700",
    "유람선/잠수함관광": "A02020800",

    "농.산.어촌 체험": "A02030100",
    "전통체험": "A02030200",
    "산사체험": "A02030300",
    "이색체험": "A02030400",
    "이색거리": "A02030600",

    "발전소": "A02040400",
    "식음료": "A02040600",
    "기타": "A02040800",
    "전자-반도체": "A02040900",
    "자동차": "A02041000",

    "다리/대교": "A02050100",
    "기념탑/기념비/전망대": "A02050200",
    "분수": "A02050300",
    "동상": "A02050400",
    "터널": "A02050500",
    "유명건물": "A02050600",

    "박물관": "A02060100",
    "기념관": "A02060200",
    "전시관": "A02060300",
    "컨벤션센터": "A02060400",
    "미술관/화랑": "A02060500",
    "공연장": "A02060600",
    "문화원": "A02060700",
    "외국문화원": "A02060800",
    "도서관": "A02060900",
    "대형서점": "A02061000",
    "문화전수시설": "A02061100",
    "영화관": "A02061200",
    "어학당": "A02061300",
    "학교": "A02061400",

    "문화관광축제": "A02070100",
    "일반축제": "A02070200",

    "전통공연": "A02080100",
    "연극": "A02080200",
    "뮤지컬": "A02080300",
    "오페라": "A02080400",
    "전시회": "A02080500",
    "박람회": "A02080600",
    "무용": "A02080800",
    "클래식음악회": "A02080900",
    "대중콘서트": "A02081000",
    "영화": "A02081100",
    "스포츠경기": "A02081200",
    "기타행사": "A02081300",
    "넌버벌": "A02081400",

    "수상레포츠": "A03010200",
    "항공레포츠": "A03010300",

    "수련시설": "A03020200",
    "경기장": "A03020300",
    "인라인(실내 인라인 포함)": "A03020400",
    "자전거하이킹": "A03020500",
    "카트": "A03020600",
    "골프": "A03020700",
    "경마": "A03020800",
    "경륜": "A03020900",
    "카지노": "A03021000",
    "승마": "A03021100",
    "스키/스노보드": "A03021200",
    "스케이트": "A03021300",
    "썰매장": "A03021400",
    "수렵장": "A03021500",
    "사격장": "A03021600",
    "야영장,오토캠핑장": "A03021700",
    "암벽등반": "A03021800",
    "서바이벌게임": "A03022000",
    "ATV": "A03022100",
    "MTB": "A03022200",
    "오프로드": "A03022300",
    "번지점프": "A03022400",
    "스키(보드) 렌탈샵": "A03022600",
    "트래킹": "A03022700",

    "윈드서핑/제트스키": "A03030100",
    "카약/카누": "A03030200",
    "요트": "A03030300",
    "스노쿨링/스킨스쿠버다이빙": "A03030400",
    "민물낚시": "A03030500",
    "바다낚시": "A03030600",
    "수영": "A03030700",
    "래프팅": "A03030800",

    "스카이다이빙": "A03040100",
    "초경량비행": "A03040200",
    "헹글라이딩/패러글라이딩": "A03040300",
    "열기구": "A03040400",

    "복합 레포츠": "A03050100",

    "5일장": "A04010100",
    "상설시장": "A04010200",
    "백화점": "A04010300",
    "면세점": "A04010400",
    "대형마트": "A04010500",
    "전문매장/상가": "A04010600",
    "공예/공방": "A04010700",
    "특산물판매점": "A04010900",
    "사후면세점": "A04011000",

    "한식": "A5010100", 
    "서양식": "A5010200",
    "일식": "A5010300",
    "중식": "A5010400",
    "이색음식점": "A5010500",
    "카페/전통찻집": "A5010600",
    "클럽": "A5010700",

    "관광호텔": "B02010100",
    "콘도미니엄": "B02010500",
    "유스호스텔": "B02010600",
    "펜션": "B02010700",
    "모텔": "B02010900",
    "민박": "B02011000",
    "게스트하우스": "B02011100",
    "홈스테이": "B02011200",
    "서비스드레지던스": "B02011300",
    "한옥": "B02011600",

    "가족코스": "C01120001",
    "나홀로코스": "C01130001",
    "힐링코스": "C01140001",
    "도보코스": "C01150001",
    "캠핑코스": "C01160001",
    "맛코스": "C01170001"
};